<?php

const BR = '<br>';

// Створіть змінну $a і присвойте їй значення 3. Виведіть значення цієї змінної на екран.

$a = 3;
echo $a . BR;

// Створіть змінні $a=10 і $b=2. Виведіть на екран їхню суму, різницю, добуток і частку (результат ділення).

$a=10;
$b = 2;

echo (($a + $b . BR) . ($a - $b . BR) . ($a * $b . BR) . ($a / $b . BR) . ($a % $b . BR));

// Створіть змінні $c=15 і $d=2. Підсумуйте їх, а результат присвойте змінній $result. 
// Виведіть на екран значення змінної $result.

$c = 15;
$d = 2;
$result = $c + $d;
echo $result . BR; // 17

// Створіть змінні $a=10, $b=2 і $c=5. Виведіть на екран їхню суму.

$a = 10;
$b = 2;
$c = 5;
echo $a + $b + $c . BR; // 17

// Створіть змінні $a=17 і $b=10. Відніміть від $a змінну $b і результат присвойте змінній $c. 
// Потім створіть змінну $d, присвойте їй значення 7. 
// Складіть змінні $c і $d, а результат запишіть у змінну $result. 
// Виведіть на екран значення змінної $result.

$a = 17;
$b = 10;
$c = $a - $b;  // 7
$d = 7;
$result = $c + $d . BR; // 14

echo $result;

// Створіть змінну $text і присвойте їй значення 'Привіт, Світ!'. Виведіть значення цієї змінної на екран.
$text = 'Привіт, Світ!';
echo $text . BR;

// Створіть змінні $text1='Привіт, ' і $text2='Світ!'. 
// За допомогою цих змінних і операції додавання рядків виведіть на екран фразу 'Привіт, Мир!'.
$text1 = 'Привіт, ';
$text2 = 'Світ!';
echo $text1 . 'Мир!' . BR;

// Створіть змінну $name і присвойте їй ваше ім'я. Виведіть на екран фразу 'Привіт, %Ім'я%!'. 
// Замість %Ім'я% має стояти ваше ім'я.
$name = 'Alex';
echo 'Привіт, ' . $name . '!' . BR;

// Створіть змінну $age і присвойте їй ваш вік. Виведіть на екран 'Мені %Вік% років!'.
$age = 39;
echo 'Мені ' . $age . ' років!' . BR;

// Створіть змінну $text і присвойте їй значення 'abcde'.
// Звертаючись до окремих символів цього рядка, виведіть на екран символ 'a', символ 'c', символ 'e'.
$text = 'abcde';
echo $text[0] . BR; // символ 'a'
echo $text[2] . BR; // символ 'c'
echo $text[4] . BR; // символ 'e'

// Дано довільний рядок, наприклад, 'abcde'. Поміняйте першу букву (тобто букву 'a') цього рядка на '!'.
$text = 'abcde';
$text[0] = '!';
echo $text . BR; // !bcde

// Створіть змінну $num і присвойте їй значення '12345'. Знайдіть суму цифр цього числа.
$num = '12345';
echo array_sum(str_split($num)) . BR; // 15

// Напишіть скрипт, який рахує кількість секунд у годині, у добі, у місяці.

$secondsInHour = 60 * 60;
echo "Кількість секунд у годині: " . number_format($secondsInHour) . BR;

$secondsInDay = 24 * $secondsInHour;
echo "Кількість секунд у добі: " . number_format($secondsInDay) . BR;

$secondsInMonth = 30 * $secondsInDay;
echo "Кількість секунд у місяці: " . number_format($secondsInMonth) . BR;

// Створіть три змінні - година, хвилина, секунда. З їхньою допомогою виведіть поточний час у форматі 'година:хвилина:секунда'.

$currentTime = new DateTime('now', new DateTimeZone('Europe/Kyiv'));

$hour = $currentTime->format('H');
$minute = $currentTime->format('i');
$second = $currentTime->format('s');

echo "Поточний час: $hour:$minute:$second" . BR;

// Створіть змінну, присвойте їй число. Підведіть це число до квадрата. 
// Виведіть його на екран.

$number = 5;
echo $number ** 2 . BR; //25

// Переробіть код так, щоб у ньому використовувалися операції +=, -=, *=, /=. 
// Кількість рядків коду при цьому не повинна змінитися.

$var = 47;
$var += 7;
$var -= 18;
$var *= 10;
$var /= 20;
echo $var . BR; // 18

// Переробіть код так, щоб у ньому використовувалася операція .=
// Кількість рядків коду при цьому не повинна змінитися.

$text = 'Я';
$text .= ' хочу';
$text .= ' знати';
$text .= ' PHP!';
echo $text . BR;

// Переробіть цей код так, щоб у ньому використовувалися операції ++ і --. 
// Кількість рядків коду при цьому не повинна змінитися.

$var = 10;
$var++;
$var++;
$var--;
echo $var . BR; // 11

// Переробіть цей код так, щоб у ньому використовувалися операції ++, -- , +=, -=, *=, /=. 
// Кількість рядків коду при цьому не повинна змінитися.

$var = 10;
$var += 7;
$var++;
$var--;
$var += 12;
$var *= 7;
$var -= 15;
echo $var . BR;

?>

<!DOCTYPE html>
<html lang="en">
<head>
  <meta charset="UTF-8">
  <meta name="viewport" content="width=device-width, initial-scale=1.0">
  <link href="../styles.css" rel="stylesheet">
  <title>php scalars</title>

</head>
<body>
  <section>
    <ul>
        <li><a href="../index.php">back to main</a></li>
        <li><a href="./arrays.php">to arrays</a></li>
    </ul>
  </section>
</body>
</html>